Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs.Status
Get API event status, reflect current operation execution status.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
The event arguments used by the WorksharedOperationProgressChanged event, this event will be raised when executing following workshared operations.
Remarks:
Remarks:
For synchronizing with central operation, there are 4 steps.
1) Save to local (before save to central) - Serializes the streams from memory to local disk cache;
Autodesk::Revit::DB::Events::DocumentSaveToLocalProgessChangedEventArgs
2) Reload latest - Downloads the streams from central model on server and merge them into local memory;
Autodesk::Revit::DB::Events::DocumentReloadLatestProgessChangedEventArgs
3) Save to central - Uploads merged streams from local memory to server central model;
Autodesk::Revit::DB::Events::DocumentSaveToCentralProgessChangedEventArgs
4) Save to local (after save to central) - Serializes the merged streams from memory to local disk cache;
Autodesk::Revit::DB::Events::DocumentSaveToLocalProgessChangedEventArgs
For document open operation, just download the model from server and then open it; Autodesk::Revit::DB::Events::DocumentOpenProgessChangedEventArgs
It is NOT recommended to deal with time-consuming work when handling WorksharedOperationProgressChanged event, otherwise it would increase synchronizing with central time.
Since:
2017 Subscription Update